// Connection types
"fs.connection.type.ftp" = "FTP";
"fs.connection.type.ftp-ssl" = "FTP with SSL/TLS";
"fs.connection.type.ftp-implicit-ssl" = "FTP with Implicit SSL/TLS";
"fs.connection.type.sftp" = "SFTP";
"fs.connection.type.s3" = "Amazon S3";


// Untitled
"fs.untitled-directory" = "名称未設定フォルダ";
"fs.untitled-file" = "名称未設定";


// Byte sizes
"fs.number-of-bytes-not-applicable" = "—";
"fs.number-of-bytes (%@)" = "%@ bytes";
"fs.number-of-kilobytes (%@)" = "%@ KB";
"fs.number-of-megabytes (%@)" = "%@ MB";
"fs.number-of-gigabytes (%@)" = "%@ GB";
"fs.number-of-terabytes (%@)" = "%@ TB";
"fs.number-of-petabytes (%@)" = "%@ PB";


// Actions
"fs.action.rename.title" = "リネーム";
"fs.action.duplicate.title" = "複製";
"fs.action.reveal-in-finder.title" = "Finder で表示";
"fs.action.recycle.title" = "ゴミ箱に移動…";
"fs.action.delete.title" = "削除…";
"fs.action.new-directory.title" = "新規フォルダ";
"fs.action.new-file.title" = "新規ファイル";
"fs.action.refresh.title" = "更新";


// Status: the operation has not yet been scheduled for execution
"fs.status.idle" = "待機中…";


// Status: the operation is acquiring a connection to the server
"fs.status.connecting" = "接続中…";


// Status: the operation is acquiring a connection to the server, now authenticating
"fs.status.authenticating" = "認証中…";


// Status: the operation is waiting until a ready-to-use connection becomes available. This means connecting and authenticating have already succeeded, but multiple operations want access to the same server.
"fs.status.waiting-for-connection" = "待機中…";


// Status: the operation is executing
"fs.status.in-progress.generic" = "転送中…";
"fs.status.in-progress.upload (item-name:%@)" = "“%@” をアップロード中…";
"fs.status.in-progress.download (item-name:%@)" = "“%@” をダウンロード中…";
"fs.status.in-progress.remove (item-name:%@)" = "“%@” を削除中…";
"fs.status.in-progress.remove (item-count:%@)" = "%@ アイテムを削除中…";
"fs.status.in-progress.set-attributes" = "属性を変更中…";


// Status: the operation completed successfully
"fs.status.finished.generic" = "完了";
"fs.status.finished.upload (item-name:%@)" = "“%@” をアップロード完了";
"fs.status.finished.download (item-name:%@)" = "“%@” をダウンロード完了";
"fs.status.finished.remove (item-name:%@)" = "“%@” を削除完了";
"fs.status.finished.remove (item-count:%@)" = "%@ アイテムを削除完了";
"fs.status.finished.set-attributes" = "属性変更完了";


// Decisions
"fs.decide.button.cancel.title" = "キャンセル";
"fs.decide.suppression-button.title" = "すべてに適用";
"fs.decide.field.password.label" = "パスワード:";

"fs.decide.should-remove.title (item-name:%@)" = "本当に “%@” を永久的に削除しますか？";
"fs.decide.should-remove.message" = "このアクションはやり直しできません。";
"fs.decide.should-remove.title" = "本当にこれらのアイテムを永久的に削除しますか？";
"fs.decide.should-remove.message (one-item-name:%@ other-item-name:%@)" = "“%@” と “%@” が削除されます。このアクションをやり直すことはできません。";
"fs.decide.should-remove.message (one-item-name:%@ other-items-count:%@)" = "“%@” と他の %@ アイテムが削除されます。このアクションをやり直すことはできません。";
"fs.decide.should-remove.button.proceed.title" = "削除";

"fs.decide.should-recycle.title (item-name:%@)" = "本当に “%@” を削除しますか？";
"fs.decide.should-recycle.message" = "アイテムをゴミ箱に移動します。このアクションはやり直しできません。";
"fs.decide.should-recycle.title" = "本当にこれらのアイテムを削除しますか？";
"fs.decide.should-recycle.message (one-item-name:%@ other-item-name:%@)" = "“%@” と “%@” をゴミ箱に移動します。このアクションをやり直すことはできません。";
"fs.decide.should-recycle.message (one-item-name:%@ other-items-count:%@)" = "“%@” と他の %@ アイテムをゴミ箱に移動します。このアクションをやり直すことはできません。";
"fs.decide.should-recycle.button.proceed.title" = "ゴミ箱に移動";

"fs.decide.should-replace-destination.title (to-item-name:%@)" = "“%@” は既に存在します。置き換えますか？";
"fs.decide.should-replace-destination.message (to-directory-name:%@)" = "フォルダ %@ に既に同じ名前のファイルまたはフォルダが存在します。置換すると現在のコンテンツは上書きされます。";
"fs.decide.should-replace-destination.button.proceed.title" = "置換";
"fs.decide.should-replace-destination.button.cancel.title" = "置換しない";

"fs.decide.password.title" = "パスワードを入力してください。";
"fs.decide.password.button.proceed.title" = "続行";

"fs.decide.max-connection-count.title (server:%@)" = "転送を高速化するために、サーバ \"%@\" へクラウドアタックを使用しますか？";
"fs.decide.max-connection-count.message" = "サーバは接続可能なコネクション数を制限していることがあります。この値は後で変更できます。";
"fs.decide.max-connection-count.button.proceed.title" = "続行";

"fs.decide.should-trust-certificate.title (app:%@ server:%@)" = "%@ can’t verify the identity of the server “%@”.";
"fs.decide.should-trust-certificate.message (server:%@)" = "The certificate for this server is invalid. You might be connecting to a server that is pretending to be “%@”, which could put your confidential information at risk. Would you like to connect to the server anyway?";
"fs.decide.should-trust-certificate.button.proceed.title" = "続行";

"fs.decide.should-trust-publickey.title (app:%@ server:%@)" = "%@ can’t verify the identity of the server “%@”.";
"fs.decide.should-trust-publickey.message (key-md5:%@)" = "The public key for this server, with fingerprint %@, is unknown. Would you like to accept the key?";
"fs.decide.should-trust-publickey.button.proceed.title" = "続行";

"fs.decide.should-trust-publickey-change.title (server:%@)" = "The server “%@” has changed its public key since you last connected.";
"fs.decide.should-trust-publickey-change.message (key-md5:%@)" = "This is most likely due to a configuration change, but you should confirm with the server administrator. The new key's fingerprint is %@. Would you like to accept the new key?";
"fs.decide.should-trust-publickey-change.button.proceed.title" = "続行";

"fs.decide.should-allow-partial-security.title (server:%@)" = "サーバ \"%@\" は完全に安全な接続をサポートしていません。";
"fs.decide.should-allow-partial-security.message" = "安全でない経路で転送が行われる場合があり、そこにはあなたが秘密にしておきたい情報が含まれるリスクがあります。サーバへの接続を強行しますか？";
"fs.decide.should-allow-partial-security.button.proceed.title" = "続行";

"fs.decide.should-detect-sync-server-time.title (server:%@)" = "サーバ \"%@\" のタイムゾーンを検出しますか？";
"fs.decide.should-detect-sync-server-time.message" = "タイムゾーンを検出するためにサーバ上に一時ファイルを作成します。このステップを省略すると、ファイルに間違って変更ありとマークされることがあるかも知れません。";
"fs.decide.should-detect-sync-server-time.button.proceed.title" = "時刻を検出して続ける";
"fs.decide.should-detect-sync-server-time.button.cancel.title" = "続行";


// Error buttons
"fs.error.button.dismiss.title" = "OK";
"fs.error.button.server-settings.title" = "設定…";
"fs.error.button.network-diagnostics.title" = "Network Diagnostics…";


// Error messages
"fs.error.generic.cannot-connect" = "サーバに接続できませんでした。";
"fs.error.generic.cannot-connect (server:%@)" = "“%@” に接続できませんでした。";

"fs.error.*.no-connection-pool" = "@alias fs.error.generic.cannot-connect";
"fs.error.*.no-connection-pool.message" = "サーバ設定に内部的な問題があるかもしれません。このエラーについてフィードバックを送信してください。";

"fs.error.*.cannot-find-host" = "@alias fs.error.generic.cannot-connect";
"fs.error.*.cannot-find-host.message" = "そのサーバは見つかりませんでした。";

"fs.error.*.cannot-connect-to-host" = "@alias fs.error.generic.cannot-connect";
"fs.error.*.cannot-connect-to-host.message" = "サーバが接続を拒否しています。";

"fs.error.*.timed-out (server:%@)" = "サーバ “%@” は応答していません。";
"fs.error.*.timed-out.message" = "接続がタイムアウトしました。サーバまたはネットワーク設定に問題があるかもしれません。またはサーバの応答がとても遅いようです。";
"fs.error.*.timed-out-for-additional-connection" = "@alias fs.error.*.timed-out";
"fs.error.*.timed-out-for-additional-connection.message" = "接続がタイムアウトしました。サーバが接続数を制限しているかもしれません。";

"fs.error.*.connection-closed" = "@alias fs.error.generic.cannot-connect";
"fs.error.*.connection-closed.message" = "サーバは接続を切断しました。";

"fs.error.*.security-failed" = "@alias fs.error.generic.cannot-connect";
"fs.error.*.security-failed.message" = "セキュアな接続を確立できませんでした。";

"fs.error.*.no-internet" = "@alias fs.error.generic.cannot-connect";
"fs.error.*.no-internet.message" = "インターネット接続がオフラインのようです。";

"fs.error.*.authentication-failed (server:%@)" = "サーバ “%@” のユーザ名またはパスワードが間違っています。";

"fs.error.*.item-exists (to-item-name:%@)" = "“%@” は既に使用されています。違う名前を選んでください。";

"fs.error.*.item-does-not-exist (item-name:%@)" = "“%@” というアイテムは存在しません。";
"fs.error.list-directory.item-does-not-exist (item-name:%@)" = "“%@” というフォルダは存在しません。";

"fs.error.copy.* (item-name:%@)" = "“%@” をコピーできませんでした。";
"fs.error.copy.item-is-alias.message" = "そのアイテムはエイリアスです。代わりに元のファイルまたはフォルダをコピーしてください。";

"fs.error.*.partially-failed" = "いくつかの処理を完了できませんでした。";
"fs.error.*.partially-failed.message" = "設定を見なおすか、もう一度試してください。";

"fs.error.*.permission-denied" = "権限がないためこのアクションを実行できません。";
"fs.error.rename.permission-denied (from-item-name:%@)" = "権限がないため “%@” をリネームできません。";

"fs.error.upload.* (item-name:%@)" = "“%@” をアップロードできませんでした。";
"fs.error.upload.partially-failed" = "いくつかのファイルをアップロードできませんでした。";
"fs.error.upload.partially-failed.message" = "転送中に以下のエラーに遭遇しました。設定を再確認するかこれらのファイルをもう一度アップロードしてみてください。";

"fs.error.remove.* (item-name:%@)" = "“%@” を削除できませんでした。";
"fs.error.remove.partially-failed" = "いくつかのファイルを削除できませんでした。";
"fs.error.remove.partially-failed.message" = "以下のエラーに遭遇しました。設定を再確認するかこれらのファイルをもう一度削除してみてください。";

"fs.error.set-attributes.* (item-name:%@)" = "“%@” の属性を変更できませんでした。";
"fs.error.set-attributes.partially-failed" = "いくつかのファイルの属性を変更できませんでした。";
"fs.error.set-attributes.partially-failed.message" = "以下のエラーに遭遇しました。設定を再確認するかこれらのファイルの属性をもう一度変更してみてください。";

"fs.error.download.partially-failed" = "いくつかのファイルをダウンロードできませんでした。";


// Error messages (addendums)
"fs.error.server-settings.message-addendum" = "設定を再確認し、サーバ管理者に確認してください。";
"fs.error.server-response.message (%@)" = "サーバからの応答: %@";